In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

# pandas的数据结构介绍
## Series

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4,7,-5,3], index = ['d', 'a', 'b', 'c'])

In [7]:
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'a', u'b', u'c'], dtype='object')

In [9]:
obj2['a']

7

In [10]:
obj2[['a', 'b', 'c']]

a    7
b   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
a    7
c    3
dtype: int64

In [12]:
obj2 * 2

d     8
a    14
b   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d      54.598150
a    1096.633158
b       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'g' in obj2

False

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 15000, 'Utah': 5000}

In [17]:
obj3 = Series(sdata)

In [18]:
obj3

Ohio      35000
Oregon    15000
Texas     71000
Utah       5000
dtype: int64

In [19]:
states = ['California', 'Ohio', 'Texas', 'Oregon']

In [20]:
obj4 = Series(sdata, index = states)

In [21]:
obj4

California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        15000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [25]:
obj4.notnull()

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         30000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
obj4.name = 'population'
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        15000.0
Name: population, dtype: float64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [31]:
data = {'States': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'population': [1.5, 1.6, 3.6, 2.4, 2.7]}
frame = DataFrame(data)

In [32]:
frame

   States  population  year
0    Ohio         1.5  2000
1    Ohio         1.6  2001
2    Ohio         3.6  2002
3  Nevada         2.4  2001
4  Nevada         2.7  2002

In [33]:
DataFrame(data, columns = ['year', 'States', 'population'])

   year  States  population
0  2000    Ohio         1.5
1  2001    Ohio         1.6
2  2002    Ohio         3.6
3  2001  Nevada         2.4
4  2002  Nevada         2.7

In [34]:
frame2 = DataFrame(data, columns = ['year', 'States', 'population', 'debt'], index = ['One', 'Two', 'Three', 'Four', 'Five'])

In [35]:
frame2

       year  States  population debt
One    2000    Ohio         1.5  NaN
Two    2001    Ohio         1.6  NaN
Three  2002    Ohio         3.6  NaN
Four   2001  Nevada         2.4  NaN
Five   2002  Nevada         2.7  NaN

In [36]:
frame2.columns

Index([u'year', u'States', u'population', u'debt'], dtype='object')

In [37]:
frame2['States']

One        Ohio
Two        Ohio
Three      Ohio
Four     Nevada
Five     Nevada
Name: States, dtype: object

In [38]:
frame2.year

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Name: year, dtype: int64

In [39]:
frame2.ix['Three']

year          2002
States        Ohio
population     3.6
debt           NaN
Name: Three, dtype: object

In [40]:
frame2['debt'] = 16.5

In [41]:
frame2

       year  States  population  debt
One    2000    Ohio         1.5  16.5
Two    2001    Ohio         1.6  16.5
Three  2002    Ohio         3.6  16.5
Four   2001  Nevada         2.4  16.5
Five   2002  Nevada         2.7  16.5

In [42]:
frame2['debt'] = np.arange(5.)

In [43]:
frame2

       year  States  population  debt
One    2000    Ohio         1.5   0.0
Two    2001    Ohio         1.6   1.0
Three  2002    Ohio         3.6   2.0
Four   2001  Nevada         2.4   3.0
Five   2002  Nevada         2.7   4.0

In [44]:
val = Series([-1.2, -1.5, -1.7], index = ['One', 'Three', 'Five'])

In [45]:
frame2['Val'] = val

In [46]:
frame2

       year  States  population  debt  Val
One    2000    Ohio         1.5   0.0 -1.2
Two    2001    Ohio         1.6   1.0  NaN
Three  2002    Ohio         3.6   2.0 -1.5
Four   2001  Nevada         2.4   3.0  NaN
Five   2002  Nevada         2.7   4.0 -1.7

In [47]:
frame2['Eastern'] = (frame2.States == 'Nevada')

In [48]:
frame2

       year  States  population  debt  Val Eastern
One    2000    Ohio         1.5   0.0 -1.2   False
Two    2001    Ohio         1.6   1.0  NaN   False
Three  2002    Ohio         3.6   2.0 -1.5   False
Four   2001  Nevada         2.4   3.0  NaN    True
Five   2002  Nevada         2.7   4.0 -1.7    True

In [49]:
del frame2['Eastern']

In [50]:
frame2

       year  States  population  debt  Val
One    2000    Ohio         1.5   0.0 -1.2
Two    2001    Ohio         1.6   1.0  NaN
Three  2002    Ohio         3.6   2.0 -1.5
Four   2001  Nevada         2.4   3.0  NaN
Five   2002  Nevada         2.7   4.0 -1.7

In [51]:
pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
frame3 = DataFrame(pop)

In [53]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [56]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [57]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [58]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [59]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [60]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [61]:
frame2.values

array([[2000, 'Ohio', 1.5, 0.0, -1.2],
       [2001, 'Ohio', 1.6, 1.0, nan],
       [2002, 'Ohio', 3.6, 2.0, -1.5],
       [2001, 'Nevada', 2.4, 3.0, nan],
       [2002, 'Nevada', 2.7, 4.0, -1.7]], dtype=object)

## 索引对象

In [62]:
obj = Series(range(3), index = ['a', 'b', 'c'])

In [63]:
index = obj.index

In [64]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [65]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [66]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [67]:
index = pd.Index(np.arange(3))

In [68]:
obj2 = Series([1.5, -2.5, 0], index = index)

In [69]:
obj2.index is index

True

In [70]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
'Ohio' in frame3.columns

True

In [72]:
2003 in frame3.index

False

# 基本功能
## 重新索引

In [73]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [74]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [75]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])

In [76]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [77]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [78]:
obj3 = Series(['Blue', 'Purple', 'Yellow'], index = [0, 2, 4])

In [79]:
obj3.reindex(range(6), method = 'ffill')

0      Blue
1      Blue
2    Purple
3    Purple
4    Yellow
5    Yellow
dtype: object

In [80]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [81]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [82]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [83]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [84]:
state = ['Texas', 'Calfornia', 'Utah']
frame.reindex(columns = state)

   Texas  Calfornia  Utah
a      1        NaN   NaN
c      4        NaN   NaN
d      7        NaN   NaN

In [85]:
frame.reindex(index = ['a', 'b', 'c', 'd'], method = 'ffill', columns = state)

   Texas  Calfornia  Utah
a      1        NaN   NaN
b      1        NaN   NaN
c      4        NaN   NaN
d      7        NaN   NaN

In [86]:
frame.ix[['a', 'b', 'c', 'd'], state]

   Texas  Calfornia  Utah
a    1.0        NaN   NaN
b    NaN        NaN   NaN
c    4.0        NaN   NaN
d    7.0        NaN   NaN

## 丢弃指定轴上的项

In [87]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [88]:
new_obj = obj.drop('c')

In [89]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
obj.drop(['a', 'e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [91]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns = ['one', 'two', 'three', 'four'])

In [92]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.drop(['Colorado', 'New York'])

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [94]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [95]:
data.drop(['one', 'two'], axis = 1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15